app/controllers/users_controller.rb

  def index
    @book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def edit
    if @user == current_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]